---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntryErrorType
source: html/92f21b30-036d-9fa8-0662-b5d0e7c474de.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntryErrorType

An Enum indicating the type of error associated with a KeyBasedTreeEntry.

## Syntax (C#)
```csharp
public enum KeyBasedTreeEntryErrorType
```